-- MySQL dump 10.13  Distrib 8.0.13, for Win64 (x86_64)
--
-- Host: localhost    Database: dlnu
-- ------------------------------------------------------
-- Server version	8.0.13

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8mb4 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `duotieba`
--

DROP TABLE IF EXISTS `duotieba`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `duotieba` (
  `id` int(50) NOT NULL AUTO_INCREMENT,
  `duotiebaname` varchar(50) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `duotieba`
--

LOCK TABLES `duotieba` WRITE;
/*!40000 ALTER TABLE `duotieba` DISABLE KEYS */;
INSERT INTO `duotieba` VALUES (1,'新大陆');
/*!40000 ALTER TABLE `duotieba` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `fatie`
--

DROP TABLE IF EXISTS `fatie`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `fatie` (
  `id` int(50) NOT NULL AUTO_INCREMENT,
  `biaoti` varchar(200) NOT NULL,
  `neirong` varchar(5000) DEFAULT NULL,
  `flag1` varchar(50) DEFAULT NULL,
  `flag2` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=103 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `fatie`
--

LOCK TABLES `fatie` WRITE;
/*!40000 ALTER TABLE `fatie` DISABLE KEYS */;
INSERT INTO `fatie` VALUES (1,'第一个帖子','第一个帖子的内容',NULL,NULL),(2,'第二贴试试','第二个帖的内容',NULL,NULL),(3,'第三个帖（和第二个帖都是空了flag1和flag2）','注意看标题',NULL,NULL),(4,'这是第四个帖','第四个帖的内容',NULL,NULL),(5,'第五个帖测试','第五个帖子的内容奥',NULL,NULL),(6,'用维吉尔发个帖试试，第六帖','第六个帖的内容，维吉尔老哥发的',NULL,NULL),(7,'第6个没成功，在用维吉尔发帖试试','第七贴的内容',NULL,NULL),(8,'似乎找找原因了，xml改了，还是维吉尔','第八贴内容',NULL,NULL),(9,'6,7,8帖全部失败','这个贴是用李白发的，估计还是失败，参数已经传入，但是没写入',NULL,NULL),(10,'维吉尔10','10帖内容',NULL,'维吉尔'),(11,'李白发的帖11','11帖内容',NULL,'李白'),(12,'我维吉尔再发一帖12','12帖内容',NULL,'维吉尔'),(13,'这是大神吧转帖','大神内容','大神吧','李白'),(14,'这是小神专帖','小神内容','小神吧','李白'),(15,'本吧第一贴','第一帖内容','新建',''),(16,'给小神吧发个帖','111','小神吧','李白'),(17,'给大神吧发个帖','111','大神吧','李白'),(18,'在给小神吧发个帖看看','咕咕咕','小神吧','李白'),(19,'我维吉尔给小神吧发个帖','维吉尔nb','小神吧','维吉尔'),(20,'本吧第一贴','第一帖内容','奥利给吧','李白'),(21,'本吧第一贴','第一帖内容','新神吧','李白'),(22,'本吧第一贴','第一帖内容','抛瓦吧','李白'),(23,'给抛瓦吧发个帖试试','没毛病吧','抛瓦吧','李白'),(24,'给抛瓦吧发个帖试试','没毛病吧','抛瓦吧','李白'),(25,'本吧第一贴','第一帖内容','mm吧','李白'),(26,'给大神吧发个帖','11111','大神吧','李白'),(27,'本吧第一贴','第一帖内容','狗屎吧','李白'),(28,'李白在小神吧发个帖','嘿嘿嘿','小神吧','李白'),(29,'李白再在小神吧发个帖','没啥','小神吧','李白'),(30,'李白发一贴','嘿嘿嘿','大神吧','李白'),(31,'本吧第一贴','第一帖内容','2012吧','李白'),(32,'给2012吧发一帖','这是内容','2012吧','李白'),(33,'再给2012吧发一贴','内容内容','2012吧','李白'),(34,'再试一帖','内容内容wdnmd','小神吧','李白'),(35,'李白试一试','114514','小神吧','李白'),(36,'维吉尔发一帖','123657','大神吧','维吉尔'),(37,'本吧第一贴','第一帖内容','方舟吧','李白'),(38,'给方舟吧发个帖试试','嘿嘿嘿','方舟吧','李白'),(39,'给2012吧发一帖试试','怀念2012','2012吧','李白'),(40,'本吧第一贴','第一帖内容','李毅吧','李白'),(41,'发个帖给李毅吧','嘿嘿嘿','李毅吧','李白'),(42,'本吧第一贴','第一帖内容','再来吧','李白'),(43,'再来吧发个帖','哈哈','再来吧','李白'),(44,'再来吧再发个帖','嘿嘿嘿','再来吧','李白'),(45,'小神吧发个帖','小神吧再发个帖','小神吧','李白'),(46,'再再发','发就完事了','小神吧','李白'),(47,'维吉尔也给2012吧回个帖','嘿嘿嘿','2012吧','维吉尔'),(48,'李白也发一贴','发就完事了','2012吧','李白'),(49,'发一发','发就完事了','大神吧','李白'),(50,'本吧第一贴','第一帖内容','刘慈欣吧','李白'),(51,'给刘慈欣吧回个帖','刘慈欣nb就完事了','刘慈欣吧','李白'),(52,'再给刘慈欣吧回个帖','没错','刘慈欣吧','李白'),(53,'发帖试试','ookami','大神吧','厉飞雨'),(54,'大家好','wdnmd','大神吧','李白'),(55,'李白是是诗人','没毛病','大神吧','李白'),(56,'本吧第一贴','第一帖内容','wow吧','李白'),(57,'测试','测试内容','2012吧','李白'),(58,'本吧第一贴','第一帖内容','测试吧','李白'),(59,'本吧第一贴','第一帖内容','ps4吧','李白'),(60,'给大神吧发个帖','这就是帖子的内容了，给大神吧发的','大神吧','李白'),(61,'维吉尔小神吧发帖测试','这是帖子的内容，wdnmd，测试','小神吧','维吉尔'),(62,'wow吧发帖测试','嘿嘿嘿','wow吧','李白'),(63,'飞流直下三千尺','疑是银河落九天','2012吧','李白'),(64,'本吧第一贴','第一帖内容','方舟水手吧','李白'),(65,'蜀道难','难于上青天','方舟水手吧','李白'),(66,'来捧个场','叶某人天下第一','大神吧','叶天眉'),(67,'再来捧个场','哈哈','大神吧','叶天眉'),(68,'小神吧也顶一下','嗯嗯','小神吧','叶天眉'),(69,'再顶一下','很好','小神吧','叶天眉'),(70,'本吧第一贴','第一帖内容','qq吧','叶天眉'),(71,'qq吧可还行','随便建的','qq吧','叶天眉'),(72,'没错，真是随便建的','如题','qq吧','叶天眉'),(73,'李白测试','测试内容','大神吧','李白'),(74,'顶一下','很好','小神吧','李白'),(75,'再顶','哎哎哎','小神吧','李白'),(76,'新界面测试','内容输入','大神吧','维吉尔'),(77,'艾吉奥发帖','随便写点内容','大神吧','ezio'),(78,'本吧第一贴','第一帖内容','JK吧','ezio'),(79,'发帖测试','内容','大神吧','李白'),(80,'本吧第一贴','欢迎您畅所欲言','起源吧','李白'),(81,'此为起源吧，你可通过上方跳转贴吧按钮跳转到你喜欢的贴吧','如题所述','起源吧','李白'),(82,'test','test内容','2012吧','李白'),(83,'本吧第一贴','欢迎您畅所欲言','ps5','李白'),(84,'本吧第一贴','欢迎您畅所欲言','iu吧','李白'),(85,'贴之起源','可从此贴吧跳转到自己喜欢的贴吧！','起源吧','李白'),(86,'凑凑热闹','不然帖子太少了','起源吧','李白'),(87,'再发一发帖子','这就是帖子的内容','起源吧','李白'),(88,'论人心冷漠','如题','起源吧','维吉尔'),(89,'起源吧作为首页贴吧','是情有可原的','起源吧','李白'),(90,'新帖哦','内容随便了','2012吧','李白'),(91,'本吧第一贴','欢迎您畅所欲言','小神吧','李白'),(92,'测试帖','测试内容','小神吧','李白'),(93,'test','123','起源吧','asd'),(94,'本吧第一贴','欢迎您畅所欲言','11吧','asd'),(95,'测试','123','11吧','asd'),(96,'在测试','111','11吧','asd'),(97,'aaa','asssa','起源吧','ccc'),(98,'本吧第一贴','欢迎您畅所欲言','vv吧','ccc'),(99,'测试','二十四','vv吧','ccc'),(100,'测试帖子','测试内容','2012吧','ako'),(101,'本吧第一贴','欢迎您畅所欲言','没有这个吧','ako'),(102,'测试','测试内容','没有这个吧','ako');
/*!40000 ALTER TABLE `fatie` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `hero`
--

DROP TABLE IF EXISTS `hero`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `hero` (
  `id` int(20) NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `Money` int(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=65 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `hero`
--

LOCK TABLES `hero` WRITE;
/*!40000 ALTER TABLE `hero` DISABLE KEYS */;
INSERT INTO `hero` VALUES (1,'李白',99888),(4,'鲁班',201713),(6,'维吉尔',999),(8,'安里',589),(9,'亚尔特留斯',45678),(10,'zhangsan',12345),(17,'巨魔战将',12534),(18,'ほむら',99999),(19,'test',12345),(20,'韩立',357148),(21,'大衍神君',98706),(22,'791382546',1234567),(23,'测试用户',3074),(25,'heihei',123456),(26,'qwe',12345),(27,'测试一哈',123455),(28,'在测试一哈',123455),(39,'托尔斯泰',12356),(43,'geili',1256),(44,'1245lk',12356),(45,'qwe11',12456),(50,'没有的名字',11111),(51,'niubi奥',24357),(52,'1111aa',3425),(53,'给力奥',12456),(54,'布偶',12345),(55,'厉飞雨',123456),(56,'狼人',123456),(57,'叶天眉',123456),(58,'ezio',123456),(59,'马化腾',12345),(60,'黑暗剑',123456),(61,'asd',123456),(62,'zzz',12345),(63,'ccc',123456),(64,'ako',12345);
/*!40000 ALTER TABLE `hero` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tiezi`
--

DROP TABLE IF EXISTS `tiezi`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `tiezi` (
  `id` int(50) NOT NULL AUTO_INCREMENT,
  `tiezineirong` varchar(5000) NOT NULL,
  `flag1` int(50) DEFAULT NULL,
  `flag2` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=149 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tiezi`
--

LOCK TABLES `tiezi` WRITE;
/*!40000 ALTER TABLE `tiezi` DISABLE KEYS */;
INSERT INTO `tiezi` VALUES (1,'这是给第一个帖子回帖的内容',1,NULL),(2,'这就是回帖的内容，由于同样没有设立flag1，不知道是回给哪个帖的',NULL,NULL),(3,'再随便回一下',NULL,NULL),(4,'这应当是第一个帖子的内容',1,NULL),(10,'回个帖，这个回帖只有第二个帖子里面才能看到',2,NULL),(11,'给第三个帖子回下帖，这个内容应该只有第三个帖里面能看到',3,NULL),(12,'回第二个帖测试一下',2,NULL),(16,'给第三个帖子回帖',3,NULL),(17,'回第一个帖测试',1,NULL),(18,'回第二个帖测试',2,NULL),(19,'再回一下第二个帖试试',2,NULL),(20,'爷再回一下第二个帖',2,NULL),(21,'爷再给第三个帖回一下',3,NULL),(22,'再回一下第一个帖',1,NULL),(23,'给第四个帖子回帖',4,NULL),(24,'给第四个帖子回下帖',4,NULL),(25,'这是用维吉尔给第一个帖回的帖子',1,NULL),(26,'上一个回帖不行，这是用李白给第一个帖子回的帖',1,'李白'),(27,'那么这个贴是用维吉尔给第一个帖子回的',1,'维吉尔'),(28,'用李白给第五个帖子回下帖',5,'李白'),(29,'嘿嘿',5,'维吉尔'),(30,'我回下帖',6,'李白'),(31,'再回个帖',1,''),(32,'李白回帖',1,'李白'),(33,'用李白回个帖',13,''),(34,'给小神吧的这个贴回一下',18,'李白'),(35,'我维吉尔要自顶一下',19,'维吉尔'),(36,'回个帖试试',22,'李白'),(37,'顶一个',19,'李白'),(38,'我维吉尔回下帖',14,'维吉尔'),(39,'我李白再回个帖',28,'李白'),(40,'再回一下',28,''),(41,'李白回个帖',29,'李白'),(42,'李白再回一帖',29,''),(43,'李白试一下',29,'李白'),(44,'李白再试一下',29,''),(45,'李白试试',29,'李白'),(46,'李白再试试',29,''),(47,'李白回一帖',30,'李白'),(48,'李白再回一帖',30,''),(49,'李白回帖',30,'李白'),(50,'李白回',30,'李白'),(51,'李白再回',30,'李白'),(52,'李白回',30,'李白'),(53,'回一哈',30,'李白'),(54,'回帖',33,'李白'),(55,'回',33,'李白'),(56,'回',33,'李白aa=1'),(57,'wdnmd',30,'李白'),(58,'很好',30,''),(59,'再给一个',30,''),(60,'回一下',13,''),(61,'再回一下',13,''),(62,'回个帖',34,'李白'),(63,'回个帖',34,''),(64,'回个帖',34,''),(65,'回帖看看',35,'李白'),(66,'再回帖看看',35,''),(67,'回帖',36,'维吉尔'),(68,'再回',36,''),(69,'回',36,'维吉尔'),(70,'啊',36,''),(71,'李白回帖',36,''),(72,'李白回帖',36,''),(73,'李白回帖',36,'李白'),(74,'李白回帖',36,'李白'),(75,'李白在回帖',36,'李白'),(76,'李白在再回帖',36,'李白'),(77,'我李白要回个帖',38,'李白'),(78,'我李白要再回个帖',38,'李白'),(79,'回一下',39,'李白'),(80,'再回一下',39,'李白'),(81,'牛逼',41,'李白'),(82,'没问题了',41,'李白'),(83,'回个帖',44,'李白'),(84,'再回个帖',44,'李白'),(85,'李白回',46,'李白'),(86,'李白再回',46,'李白'),(87,'李白在再回',46,'李白'),(88,'李白回帖试试',34,'李白'),(89,'维吉尔回',47,'维吉尔'),(90,'李白回',47,'李白'),(91,'李白回帖',48,'李白'),(92,'李白再回',48,'李白'),(93,'回一回',49,'李白'),(94,'再回一回',49,'李白'),(95,'回帖试试',52,'李白'),(96,'再回帖试试',52,'李白'),(97,'回帖',53,'厉飞雨'),(98,'再回',53,'厉飞雨'),(99,'。。。',54,'李白'),(100,'回帖测试',54,'李白'),(101,'..',33,'李白'),(102,'回一下试试',33,'李白'),(103,'回帖测试',57,'李白'),(104,'李白给你回一下',13,'李白'),(105,'自顶一下',61,'维吉尔'),(106,'回帖试试',62,'李白'),(107,'再回一下试试',62,'李白'),(108,'狗屎',13,'李白'),(109,'自顶，好诗！',63,'李白'),(110,'再顶一下',63,'李白'),(111,'好诗！',65,'李白'),(112,'李白nb',65,'李白'),(113,'',65,'李白'),(114,'空贴可耻！',65,'李白'),(115,'世界啊',13,'李白'),(116,'人生呢',13,'李白'),(117,'算是完成了嘛？',31,'李白'),(118,'自顶',67,'叶天眉'),(119,'挽尊',67,'叶天眉'),(120,'回帖？',68,'叶天眉'),(121,'再回',68,'叶天眉'),(122,'哎',71,'叶天眉'),(123,'嘿嘿',71,'叶天眉'),(124,'回帖',73,'李白'),(125,'再回',73,'李白'),(126,'嘿嘿',75,'李白'),(127,'嘿嘿嘿',75,'李白'),(128,'我也来回个帖',13,'ezio'),(129,'再回一个测试',79,'李白'),(130,'好贴，顶一个',81,'李白'),(131,'再顶一个',81,'李白'),(132,'回帖',82,'李白'),(133,'在回帖内容',82,'李白'),(134,'回帖嗷嗷',32,'李白'),(135,'再回哎',32,'李白'),(136,'不信了都',81,'李白'),(137,'顶帖',87,'李白'),(138,'没错',89,'李白'),(139,'挽尊',90,'李白'),(140,'好贴~顶一个',85,'维吉尔'),(141,'再回一下',85,'维吉尔'),(142,'1234',93,'asd'),(143,'1111',93,'asd'),(144,'O(∩_∩)O哈哈~',96,'asd'),(145,'没毛病',96,'asd'),(146,'ces',97,'ccc'),(147,'测试测试',99,'ccc'),(148,'回帖测试',100,'ako');
/*!40000 ALTER TABLE `tiezi` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `user` (
  `id` int(20) NOT NULL AUTO_INCREMENT,
  `login_name` int(20) NOT NULL,
  `password` int(20) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,791382546,123456);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-11-01 11:25:08
